[
  {
    "id": "E001",
    "title": "Letter from Abqu",
    "author": "Abqu",
    "message": "<p>If you're reading this letter, then I'm already gone.</p><p>But don't worry, you've got this!</p><p>I had to leave unexpectedly, for reasons I cannot disclose.  But here's what you need to know:</p><p>First, this is your shop.  Feel free to use it as you see fit.</p><p>Oren, the miner, and Revere, the daring thief, should be around to help you get started.</p><p>I've also included some gold for you to start your operations.</p><p>Here's what you should do:<br>- start making Knives, for income;<br>- give Revere one of those Knives to make her stronger;<br>- send her out into the dungeon, to get crafting materials;<br>- hire a new worker, and;<br>- purchase another crafting slot</p><p>If you follow these steps, you should be well on your way to success.</p><p>Remember, all playstyles are viable (whatever that means).</p><p>You may hear from me again in the future.</p><p>Your friend,</p><p>ABQU</p><p>P.S. I've left descriptions of the wares and my thoughts on the residents of the town.  You'll do great! Okay, bye.</p>",
    "type": "letter"
  },
  {
    "id": "E002",
    "title": "Letter from Abqu",
    "author": "Abqu",
    "message": "<p>Hey, I'm totally gone and not watching you, so this is a total coincidence, but...</p><p>I just noticed you unlocked all ten of the workers!  That's incredible.</p><p>If you haven't already, you should start leveling your workers.</p><p>Oh, I almost forgot!</p><p>There are more workers to be discovered.  Rumor has it, once your original workers reach a certain level, advanced workers will become available.</p><p>Isn't that a neat little progression system?</p><p>If anyone asks, I've gone missing.</p><p>Not watching you,</p><p>ABQU</p>",
    "type": "letter"
  },
  {
    "id": "E003",
    "title": "Letter from Abqu",
    "author": "Abqu",
    "message": "<p>Hi.</p><p>It's me, Abqu, your resident .... person.</p><p>Congrats on unlocking your first advanced worker!  What a doozy that was, huh.</p><p>Anyway, they also will level up just like those other lackeys, but with one key difference:</p><p>Advanced workers take higher quality items to level up.</p><p>They standard workers took common items; these advanced workers will expect good quality stuff.</p><p>Keep up the great work!</p><p>Your mentor,</p><p>ABQU</p>",
    "type": "letter"
  },
  {
    "id": "E004",
    "title": "Dungeon Reward",
    "author": "Adventure League",
    "message": "<p>Thanks to your efforts, our group made it back safe and sound! Here's a cut of the loot as a reward.</p><p>Warm Regards,</p><p>The Adventure League</p>",
    "type": "dungeon"
  }
]